Tutorials-2.4.0/constant/polyMesh/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.4.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant/polyMesh";
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 0.001;

//        4_______________5
//        /|             /|
//      2/_|___________3/ |  y
//       | |            | | /
//       | |0___________|_1/
//       | /            | /
//       |/_____________|/__________x
//       0              1
vertices
(
    (  0.0  0.0             0.0)
    (254.0  0.0             0.0)
    (  0.0 -0.988344491815 22.6368105216)
    (254.0 -0.765568351423 17.5343980323)
    (  0.0  0.988344491815 22.6368105216)
    (254.0  0.765568351423 17.5343980323)
);

blocks
(
//    hex (0 1 1 0 2 3 5 4) (200 1 120)
    hex (0 1 1 0 2 3 5 4) (200 1 30)
    simpleGrading
    (
        1
        1
        (
        // 0.014317
        // 2.54e-4 (.36 .28 .36) (.40 .20 .40) (2.580 0.387) 1.09
        // 1.27e-4 (.26 .48 .26) (.30 .40 .30) (2.292 0.436) 1.05
        // 6.35e-5 (.19 .62 .19) (.24 .52 .24) (2.221 0.450) 1.03
        //         len%          ncell%        expansion-ratio
            (0.19 0.24 2.221)
            (0.62 0.52 1)
            (0.19 0.24 0.450)
        )
    )
);

edges
(
    spline 2 3
    (
        ( 0.635 -0.988326202205 22.6363916207 )
        ( 1.27 -0.988271335856 22.6351349747 )
        ( 1.905 -0.988179900215 22.6330407542 )
        ( 2.54 -0.988051907694 22.6301092435 )
        ( 3.175 -0.987887375671 22.6263408406 )
        ( 3.81 -0.987686326494 22.6217360574 )
        ( 4.445 -0.987448787479 22.6162955195 )
        ( 5.08 -0.987174790919 22.6100199665 )
        ( 5.715 -0.986864374081 22.6029102521 )
        ( 6.35 -0.986517579216 22.5949673438 )
        ( 6.985 -0.986134453559 22.5861923235 )
        ( 7.62 -0.985715049336 22.5765863876 )
        ( 8.255 -0.98525942377 22.5661508464 )
        ( 8.89 -0.984767639086 22.5548871253 )
        ( 9.525 -0.984239762517 22.5427967641 )
        ( 10.16 -0.983675866315 22.5298814177 )
        ( 10.795 -0.983076027755 22.516142856 )
        ( 11.43 -0.982440329143 22.501582964 )
        ( 12.065 -0.981768857827 22.4862037424 )
        ( 12.7 -0.981061706209 22.4700073076 )
        ( 13.335 -0.980318971748 22.4529958916 )
        ( 13.97 -0.979540756976 22.4351718429 )
        ( 14.605 -0.978727169507 22.4165376263 )
        ( 15.24 -0.97787832205 22.3970958231 )
        ( 15.875 -0.976994332422 22.3768491319 )
        ( 16.51 -0.976075323556 22.3558003683 )
        ( 17.145 -0.975121423521 22.3339524656 )
        ( 17.78 -0.974132765532 22.3113084748 )
        ( 18.415 -0.973109487967 22.2878715654 )
        ( 19.05 -0.972051734379 22.2636450252 )
        ( 19.685 -0.970959653516 22.2386322611 )
        ( 20.32 -0.969833399333 22.2128367994 )
        ( 20.955 -0.968673131015 22.1862622858 )
        ( 21.59 -0.967479012989 22.1589124865 )
        ( 22.225 -0.966251214944 22.130791288 )
        ( 22.86 -0.964989911853 22.1019026977 )
        ( 23.495 -0.963695283989 22.0722508446 )
        ( 24.13 -0.962367516948 22.0418399796 )
        ( 24.765 -0.961006801665 22.0106744758 )
        ( 25.4 -0.959613334444 21.9787588292 )
        ( 26.035 -0.958187316971 21.9460976594 )
        ( 26.67 -0.956728956345 21.9126957095 )
        ( 27.305 -0.955238465095 21.8785578474 )
        ( 27.94 -0.953716061209 21.8436890657 )
        ( 28.575 -0.952161968155 21.8080944828 )
        ( 29.21 -0.950576414911 21.771779343 )
        ( 29.845 -0.948959635988 21.7347490176 )
        ( 30.48 -0.947311871456 21.6970090051 )
        ( 31.115 -0.945633366977 21.658564932 )
        ( 31.75 -0.943924373826 21.6194225536 )
        ( 32.385 -0.942185148927 21.5795877542 )
        ( 33.02 -0.940415954877 21.5390665485 )
        ( 33.655 -0.938617059982 21.4978650816 )
        ( 34.29 -0.936788738281 21.45598963 )
        ( 34.925 -0.934931269585 21.4134466025 )
        ( 35.56 -0.933044939506 21.3702425406 )
        ( 36.195 -0.93113003949 21.3263841196 )
        ( 36.83 -0.929186866849 21.281878149 )
        ( 37.465 -0.927215724803 21.2367315737 )
        ( 38.1 -0.925216922504 21.1909514745 )
        ( 38.735 -0.923190775084 21.144545069 )
        ( 39.37 -0.921137603681 21.0975197125 )
        ( 40.005 -0.919057735482 21.0498828989 )
        ( 40.64 -0.91695150376 21.0016422614 )
        ( 41.275 -0.914819247913 20.9528055734 )
        ( 41.91 -0.9126613135 20.9033807495 )
        ( 42.545 -0.910478052283 20.8533758465 )
        ( 43.18 -0.908269822268 20.8027990639 )
        ( 43.815 -0.906036987745 20.7516587455 )
        ( 44.45 -0.903779919329 20.6999633797 )
        ( 45.085 -0.901498994002 20.6477216008 )
        ( 45.72 -0.899194595155 20.5949421898 )
        ( 46.355 -0.896867112633 20.5416340758 )
        ( 46.99 -0.894516942776 20.4878063364 )
        ( 47.625 -0.892144488464 20.4334681991 )
        ( 48.26 -0.889750159161 20.3786290421 )
        ( 48.895 -0.887334370958 20.3232983955 )
        ( 49.53 -0.884897546621 20.2674859422 )
        ( 50.165 -0.882440115633 20.211201519 )
        ( 50.8 -0.87996251424 20.1544551176 )
        ( 51.435 -0.877465185497 20.0972568855 )
        ( 52.07 -0.874948579315 20.0396171276 )
        ( 52.705 -0.872413152502 19.9815463063 )
        ( 53.34 -0.869859368813 19.9230550434 )
        ( 53.975 -0.867287698993 19.8641541208 )
        ( 54.61 -0.864698620823 19.8048544814 )
        ( 55.245 -0.862092619165 19.7451672304 )
        ( 55.88 -0.859470186006 19.6851036361 )
        ( 56.515 -0.856831820504 19.6246751313 )
        ( 57.15 -0.85417802903 19.5638933135 )
        ( 57.785 -0.851509325211 19.5027699469 )
        ( 58.42 -0.848826229973 19.4413169627 )
        ( 59.055 -0.846129271584 19.37954646 )
        ( 59.69 -0.843418985692 19.3174707074 )
        ( 60.325 -0.840695915364 19.255102143 )
        ( 60.96 -0.83796061113 19.1924533761 )
        ( 61.595 -0.835213631011 19.1295371875 )
        ( 62.23 -0.832455540562 19.0663665305 )
        ( 62.865 -0.829686912902 19.0029545317 )
...
    )

    spline 4 5
    (
        ( 0.635 0.988326202205 22.6363916207 )
        ( 1.27 0.988271335856 22.6351349747 )
        ( 1.905 0.988179900215 22.6330407542 )
        ( 2.54 0.988051907694 22.6301092435 )
        ( 3.175 0.987887375671 22.6263408406 )
        ( 3.81 0.987686326494 22.6217360574 )
        ( 4.445 0.987448787479 22.6162955195 )
        ( 5.08 0.987174790919 22.6100199665 )
        ( 5.715 0.986864374081 22.6029102521 )
        ( 6.35 0.986517579216 22.5949673438 )
        ( 6.985 0.986134453559 22.5861923235 )
        ( 7.62 0.985715049336 22.5765863876 )
        ( 8.255 0.98525942377 22.5661508464 )
        ( 8.89 0.984767639086 22.5548871253 )
        ( 9.525 0.984239762517 22.5427967641 )
        ( 10.16 0.983675866315 22.5298814177 )
        ( 10.795 0.983076027755 22.516142856 )
        ( 11.43 0.982440329143 22.501582964 )
        ( 12.065 0.981768857827 22.4862037424 )
        ( 12.7 0.981061706209 22.4700073076 )
        ( 13.335 0.980318971748 22.4529958916 )
        ( 13.97 0.979540756976 22.4351718429 )
        ( 14.605 0.978727169507 22.4165376263 )
        ( 15.24 0.97787832205 22.3970958231 )
        ( 15.875 0.976994332422 22.3768491319 )
        ( 16.51 0.976075323556 22.3558003683 )
        ( 17.145 0.975121423521 22.3339524656 )
        ( 17.78 0.974132765532 22.3113084748 )
        ( 18.415 0.973109487967 22.2878715654 )
        ( 19.05 0.972051734379 22.2636450252 )
        ( 19.685 0.970959653516 22.2386322611 )
        ( 20.32 0.969833399333 22.2128367994 )
        ( 20.955 0.968673131015 22.1862622858 )
        ( 21.59 0.967479012989 22.1589124865 )
        ( 22.225 0.966251214944 22.130791288 )
        ( 22.86 0.964989911853 22.1019026977 )
        ( 23.495 0.963695283989 22.0722508446 )
        ( 24.13 0.962367516948 22.0418399796 )
        ( 24.765 0.961006801665 22.0106744758 )
        ( 25.4 0.959613334444 21.9787588292 )
        ( 26.035 0.958187316971 21.9460976594 )
        ( 26.67 0.956728956345 21.9126957095 )
        ( 27.305 0.955238465095 21.8785578474 )
        ( 27.94 0.953716061209 21.8436890657 )
        ( 28.575 0.952161968155 21.8080944828 )
        ( 29.21 0.950576414911 21.771779343 )
        ( 29.845 0.948959635988 21.7347490176 )
        ( 30.48 0.947311871456 21.6970090051 )
        ( 31.115 0.945633366977 21.658564932 )
        ( 31.75 0.943924373826 21.6194225536 )
        ( 32.385 0.942185148927 21.5795877542 )
        ( 33.02 0.940415954877 21.5390665485 )
        ( 33.655 0.938617059982 21.4978650816 )
        ( 34.29 0.936788738281 21.45598963 )
        ( 34.925 0.934931269585 21.4134466025 )
        ( 35.56 0.933044939506 21.3702425406 )
        ( 36.195 0.93113003949 21.3263841196 )
        ( 36.83 0.929186866849 21.281878149 )
        ( 37.465 0.927215724803 21.2367315737 )
        ( 38.1 0.925216922504 21.1909514745 )
        ( 38.735 0.923190775084 21.144545069 )
        ( 39.37 0.921137603681 21.0975197125 )
        ( 40.005 0.919057735482 21.0498828989 )
        ( 40.64 0.91695150376 21.0016422614 )
        ( 41.275 0.914819247913 20.9528055734 )
        ( 41.91 0.9126613135 20.9033807495 )
        ( 42.545 0.910478052283 20.8533758465 )
        ( 43.18 0.908269822268 20.8027990639 )
        ( 43.815 0.906036987745 20.7516587455 )
        ( 44.45 0.903779919329 20.6999633797 )
        ( 45.085 0.901498994002 20.6477216008 )
        ( 45.72 0.899194595155 20.5949421898 )
        ( 46.355 0.896867112633 20.5416340758 )
        ( 46.99 0.894516942776 20.4878063364 )
        ( 47.625 0.892144488464 20.4334681991 )
        ( 48.26 0.889750159161 20.3786290421 )
        ( 48.895 0.887334370958 20.3232983955 )
        ( 49.53 0.884897546621 20.2674859422 )
        ( 50.165 0.882440115633 20.211201519 )
        ( 50.8 0.87996251424 20.1544551176 )
        ( 51.435 0.877465185497 20.0972568855 )
        ( 52.07 0.874948579315 20.0396171276 )
        ( 52.705 0.872413152502 19.9815463063 )
        ( 53.34 0.869859368813 19.9230550434 )
        ( 53.975 0.867287698993 19.8641541208 )
        ( 54.61 0.864698620823 19.8048544814 )
        ( 55.245 0.862092619165 19.7451672304 )
        ( 55.88 0.859470186006 19.6851036361 )
        ( 56.515 0.856831820504 19.6246751313 )
        ( 57.15 0.85417802903 19.5638933135 )
        ( 57.785 0.851509325211 19.5027699469 )
        ( 58.42 0.848826229973 19.4413169627 )
        ( 59.055 0.846129271584 19.37954646 )
        ( 59.69 0.843418985692 19.3174707074 )
        ( 60.325 0.840695915364 19.255102143 )
        ( 60.96 0.83796061113 19.1924533761 )
        ( 61.595 0.835213631011 19.1295371875 )
        ( 62.23 0.832455540562 19.0663665305 )
        ( 62.865 0.829686912902 19.0029545317 )
...
);

boundary
(
    inlet
    {
        type    patch;
        faces
        (
            (0 2 4 0)
        );
    }

    outlet
    {
        type    patch;
        faces
        (
            (5 3 1 1)
        );
    }

    walls
    {
        type    wall;
        faces
        (
            (2 3 5 4)
        );
    }

    front
    {
        type    wedge;
        faces
        (
            (0 1 3 2)
        );
    }

    back
    {
        type    wedge;
        faces
        (
            (0 4 5 1)
        );
    }

    axis
    {
        type    empty;
        faces
        (
            (0 0 1 1)
        );
    }
);

// ************************************************************************* //
