Tutorials-2.4.0/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.4.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    inlet
    {
        type            patch;
        nFaces          30;
        startFace       11770;
    }
    outlet
    {
        type            patch;
        nFaces          30;
        startFace       11800;
    }
    walls
    {
        type            wall;
        inGroups        1(wall);
        nFaces          200;
        startFace       11830;
    }
    front
    {
        type            wedge;
        inGroups        1(wedge);
        nFaces          6000;
        startFace       12030;
    }
    back
    {
        type            wedge;
        inGroups        1(wedge);
        nFaces          6000;
        startFace       18030;
    }
    axis
    {
        type            empty;
        inGroups        1(empty);
        nFaces          0;
        startFace       24030;
    }
)

// ************************************************************************* //
