Tutorials-2.4.0/constant/thermophysicalProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.4.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      thermophysicalProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

LiqPhaseName    Liq;
GasPhaseName    Gas;

pMin            pMin [ 1 -1 -2 0 0 0 0 ] 600;

sigma           sigma [ 1 0 -2 0 0 0 0 ] 0.07;

Liq
{
    p		p;
    T		T;
    
    Cp          4195.0;
    Cv		4194.0;
    mu          3.645e-4;
    Pr          2.289;
    rho0	1027.0;
    p0		0.0;
    R		3000.0;
}

Gas
{
    p		p;
    T		T;

    Cp          1007.0;
    Cv		719.3;
    mu          1.6e-5;
    Pr          1;
    rho0	0.0;
    p0		0.0;
    R		287.09;
}


// ************************************************************************* //
