Tutorials-2.4.0/0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.4.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 6705.128;

boundaryField
{
    inlet
    {
        type            totalPressure;
        phi             phi;
        psi             thermo:psi;
        gamma           0.99;
        p0              uniform 6894.757;
    }
    outlet
    {
        type            totalPressure;
        phi             phi;
        psi             thermo:psi;
        gamma           0.99;
        p0              uniform 6136.33373;
    }
    walls
    {
        type            zeroGradient;
    }
    #include "constrain.include"
}

// ************************************************************************* //
